In [17]:
import pandas as pd
import numpy as np

obj= pd.Series([5,10,15,20,25,30])
print(obj)
print('\n')
print(obj.index)
print('\n')
print(obj.values)
print('\n')

obj2= pd.Series([5.5,10.6,15.9,20.13,25.50,30.25])
print(obj2)
print('\n')
print(obj2[0])
print('\n')
print(obj2.index)
print('\n')
print(obj2.values)
print('\n')

0     5
1    10
2    15
3    20
4    25
5    30
dtype: int64


RangeIndex(start=0, stop=6, step=1)


[ 5 10 15 20 25 30]


0     5.50
1    10.60
2    15.90
3    20.13
4    25.50
5    30.25
dtype: float64


5.5


RangeIndex(start=0, stop=6, step=1)


[ 5.5  10.6  15.9  20.13 25.5  30.25]

In [18]:
Sdata={"Nairobi":10000,"Mombasa":20000,"Nakuru":15000,"Bungoma":25000,"Kajiado":35000,"Homabay":0,}
obj3=pd.Series(Sdata)
print(obj3)

Nairobi    10000
Mombasa    20000
Nakuru     15000
Bungoma    25000
Kajiado    35000
Homabay        0
dtype: int64

In [20]:
names = ['Levy','Amigo','Gus','Fring','Gustavo','Prime','Wanyonyi','Palmer','Noni','Jackson']
obj4 = pd.Series(names)
print(obj4)

0        Levy
1       Amigo
2         Gus
3       Fring
4     Gustavo
5       Prime
6    Wanyonyi
7      Palmer
8        Noni
9     Jackson
dtype: object

In [22]:
print(obj3.isnull())

Nairobi    False
Mombasa    False
Nakuru     False
Bungoma    False
Kajiado    False
Homabay    False
dtype: bool

In [23]:
print(obj2.isnull())

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [24]:
print(obj3.notnull())

Nairobi    True
Mombasa    True
Nakuru     True
Bungoma    True
Kajiado    True
Homabay    True
dtype: bool

In [26]:
print(obj2.notnull())

0    True
1    True
2    True
3    True
4    True
5    True
dtype: bool

In [34]:
obj3.name = 'counties'
print(obj3)

countyname
Nairobi    10000
Mombasa    20000
Nakuru     15000
Bungoma    25000
Kajiado    35000
Homabay        0
Name: counties, dtype: int64

In [35]:
obj3.index.name = 'countyname'
print(obj3)

countyname
Nairobi    10000
Mombasa    20000
Nakuru     15000
Bungoma    25000
Kajiado    35000
Homabay        0
Name: counties, dtype: int64

In [41]:
data = {'studentname':['levy','james','john','alice','bob','hillary'], 'YOB':[2002,2004,2006,2000,2008,2010],'weight':[50.25,45.65,38.50,60.85,72.40,65.65]}

students = pd.DataFrame(data)
print(students)

  studentname   YOB  weight
0        levy  2002   50.25
1       james  2004   45.65
2        john  2006   38.50
3       alice  2000   60.85
4         bob  2008   72.40
5     hillary  2010   65.65

In [44]:
pd.DataFrame(data, columns= ['studentname','YOB','weight'])

  studentname   YOB  weight
0        levy  2002   50.25
1       james  2004   45.65
2        john  2006   38.50
3       alice  2000   60.85
4         bob  2008   72.40
5     hillary  2010   65.65

In [53]:
print(data['studentname'])
print('\n')
print(data['YOB'])
print('\n')
print(data['weight'])

['levy', 'james', 'john', 'alice', 'bob', 'hillary']


[2002, 2004, 2006, 2000, 2008, 2010]


[50.25, 45.65, 38.5, 60.85, 72.4, 65.65]